Revit 2025 API
FabricationMaterialType Enumeration
 An enumerated type listing all fabrication material types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum FabricationMaterialType
Public Enumeration FabricationMaterialType
public enum class FabricationMaterialType
type FabricationMaterialType
Members
Member name | Value | Description
Unknown | 0 |  Unknown material type
Ductwork | 1 |  Flatbed material type (thickness/wire gauge)
Pipework | 2 |  Pipework material type (index/specification name)
Containment | 3 |  Containment material type (index/specification name)
See Also
Reference
Autodesk.Revit.DB Namespace